[
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 813 In-book reference : Book 4, Hadith 1",
    "grade": "",
    "arabic": "عن البراء بن عازب رضى الله عنهما قال: كان رسول الله صلى الله عليه وسلم ِإذا أوى إلى فراشه نام على شقه الأيمن، ثم قال: \" اللهم أسلمت نفسي إليك، ووجهت وجهي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجى منك إلا إليك. آمنت بكتابك الذي أنزلت . ونبيك الذي أرسلت\" . ((رواه البخاري بهذا اللفظ في كتاب الأدب من صحيحه))",
    "english": "Al-Bara' bin 'Azib (May Allah be pleased with them) reported: Whenever Messenger of Allah (صلى الله عليه وسلم) went to bed, he would lie down on his right side and recite: \"Allahumma aslamtu nafsi ilaika, wa wajjahtu wajhi ilaika, wa fawwadtu amri ilaika, wa 'alja'tu zahri ilaika, raghbatan wa rahbatan ilaika, la malja'a wa la manja illa ilaika. Amantu bikitabikal-ladhi anzalta, wa nabiyyikal-ladhi arsalta [O Allah! I have submitted myself to You, I have turned my face to You, committed my affairs to You, and depend on You for protection out of desire for You and out of fear of You (expecting Your reward and fearing Your punishment). There is no refuge and no place of safety from You but with You. I believed in the Book You have revealed, and in the Prophet You have sent (i.e., Muhammad (صلى الله عليه وسلم)).]\" [Al-Bukhari] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 814 In-book reference : Book 4, Hadith 2",
    "grade": "Al-Bara' bin 'Azib (May Allah be pleased with them) reported: Messenger of Allah (صلى الله عليه وسلم) directed me thus: \"Whenever you go to bed, perform Wudu' as you do for Salat then (before sleeping) recite: 'O Allah! I have submitted myself to You, I have turned myself to You, committed my affairs to You and sought Your refuge for protection out of desire for You and fear of You (expecting Your reward and fearing Your punishment). There is no refuge and no place of safety from You but with You. I believe in the Book You have revealed and in the Prophet (صلى الله عليه وسلم) You have sent.\"' Messenger of Allah (صلى الله عليه وسلم) added: \"If anyone recites these words and dies during the night, he will die on the true Deen, and if he remains alive till the morning, he will obtain good. And make this supplication your last words (before sleeping).\" [Al-Bukhari and Muslim] . وعنه قال: قال لي رسول الله صلى الله عليه وسلم : \"إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن ، وقل ... \" وذكر نحوهن وفيه: \" واجعلهن آخر ما تقول\" ((متفق عليه)).",
    "arabic": "وعنه قال: قال لي رسول الله صلى الله عليه وسلم : \"إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن ، وقل ... \" وذكر نحوهن وفيه: \" واجعلهن آخر ما تقول\" ((متفق عليه)).",
    "english": "Al-Bara' bin 'Azib (May Allah be pleased with them) reported: Messenger of Allah (صلى الله عليه وسلم) directed me thus: \"Whenever you go to bed, perform Wudu' as you do for Salat then (before sleeping) recite: 'O Allah! I have submitted myself to You, I have turned myself to You, committed my affairs to You and sought Your refuge for protection out of desire for You and fear of You (expecting Your reward and fearing Your punishment). There is no refuge and no place of safety from You but with You. I believe in the Book You have revealed and in the Prophet (صلى الله عليه وسلم) You have sent.\"' Messenger of Allah (صلى الله عليه وسلم) added: \"If anyone recites these words and dies during the night, he will die on the true Deen, and if he remains alive till the morning, he will obtain good. And make this supplication your last words (before sleeping).\" [Al-Bukhari and Muslim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 815 In-book reference : Book 4, Hadith 3",
    "grade": "",
    "arabic": "وعن عائشة رضى الله عنها قالت: كان النبي صلى الله عليه وسلم يصلى من الليل إحدى عشرا ركعة، فإذا طلع الفجر صلى ركعتين خفيفتين ، ثم اضطجع على شقه الأيمن حتى يجئ المؤذن فيؤذنه ((متفق عليه)).",
    "english": "'Aishah (May Allah be pleased with her) reported: The Prophet (صلى الله عليه وسلم) used to offer eleven Rak'ah of optional Salat (prayers) in the latter part of night. When it was about dawn, he would offer two short Rak'ah and then would lie down on his right side till the Mu'adhdhin (one who calls for prayer) would come to inform him that the congregation had gathered (for prayer). [Al-Bukhari and Muslim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 816 In-book reference : Book 4, Hadith 4",
    "grade": "",
    "arabic": "وعن حذيفة رضى الله عنه قال:كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل وضع يده تحت خده، ثم يقول: \"اللهم باسمك أموت وأحيا\" وإذا استيقظ قال: \"الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور\" ((رواه البخاري)).",
    "english": "Hudhaifah (May Allah be pleased with him) reported: Whenever the Prophet (صلى الله عليه وسلم) lay down for sleep at night, he would place his (right) hand under his (right) cheek and supplicate: \"Allahumma bismika amutu wa ahya [O Allah, with Your Name will I die and live (wake up)].\" And when he woke up, he would supplicate: \"Al-hamdu lillahil-ladhi ahyana ba'da ma amatana, wa ilaihin-nushur (All praise is due to Allah, Who has brought us back to life after He has caused us to die, and to Him is the return).\" [Al-Bukhari] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 817 In-book reference : Book 4, Hadith 5",
    "grade": "",
    "arabic": "وعن يعيش بن طخفة الغفارى رضى الله عنه قال: قال أبى: بينما أنا مضطجع في المسجد على بطني إذا رجل يحركني برجله فقال: \"إن هذه ضجعة يبغضها الله\" قال: فنظرت ، فإذا رسول الله صلى الله عليه وسلم. ((رواه أبو داود بإسناد صحيح)).",
    "english": "Ya'ish bin Tikhfah Al-Ghifari (May Allah be pleased with him) reported: My father said: I was lying down on my belly in the mosque when someone shook me with his foot and said, \"Lying down this way is disapproved by Allah.\" I looked up and saw that it was Messenger of Allah (صلى الله عليه وسلم). [Abu Dawud] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 818 In-book reference : Book 4, Hadith 6",
    "grade": "",
    "arabic": "وعن أبى هريرة رضى الله عنه ، عن رسول الله صلى الله عليه وسلم قال: \" من قعد مقعداً لم يذكر الله تعالى فيه،كانت عليه من الله تعالى ترة، ومن اضطجع مضجعاً لا يذكر الله تعالى فيه، كانت عليه من الله ترة\" ((رواه أبو داود بإسناد حسن)). \"الترة\" بكسر التاء المثناة من فوق، وهي: النقص، وقيل: التبعة.",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"Whoever sits in a place where he does not remember Allah (SWT), he will suffer loss and incur displeasure of Allah; and whoever lies down (to sleep) in a place where he does not remember Allah, he will suffer sorrow and incur displeasure of Allah.\" [Abu Dawud] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 819 In-book reference : Book 4, Hadith 7",
    "grade": "",
    "arabic": "عن عبد الله بن زيد رضى الله عنه أنه رأى رسول الله صلى الله عليه وسلم مستلقياً في المسجد، واضعاً إحدى رجليه على الأخرى. ((متفق عليه)).",
    "english": "'Abdullah bin Zaid (May Allah be pleased with them) reported: I saw Messenger of Allah (صلى الله عليه وسلم) lying down on his back in the mosque, placing one leg on the other. [Al-Bukhari and Muslim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 820 In-book reference : Book 4, Hadith 8",
    "grade": "",
    "arabic": "وعن جابر بن سمرة رضى الله عنه قال: كان النبي صلى الله عليه وسلم إذا صلى الفجر تربع في مجلسه حتى تطلع الشمس حسناء. حديث صحيح، رواه أبو داود وغيره بأسانيد صحيحة.",
    "english": "Jabir bin Samurah (May Allah be pleased with him) reported: After the Fajr (dawn) prayer the Prophet (صلى الله عليه وسلم) used to sit crossed legged in the same place in which he had prayed till the sun shone brightly. [Abu Dawud] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 821 In-book reference : Book 4, Hadith 9",
    "grade": "",
    "arabic": "وعن ابن عمر رضى الله عنهما قال: رأيت رسول الله صلى الله عليه وسلم بفناء الكعبة محتبياً بيديه هكذا. ووصف بيديه الاحتباء، وهو القرفصاء. ((رواه البخاري)).",
    "english": "Ibn 'Umar (May Allah be pleased with them) reported: I saw Messenger of Allah (صلى الله عليه وسلم) sitting in the compound of the Holy Ka'bah, with the thighs against the stomach and arms around his legs. [Al- Bukhari] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 822 In-book reference : Book 4, Hadith 10",
    "grade": "",
    "arabic": "وعن قيلة بنت مخرمة رضى الله عنها قالت: رأيت النبي صلى الله عليه وسلم وهو قاعد القرفصاء، فلما رأيت رسول الله صلى الله عليه وسلم المتخشع في الجلسة أرعدت من الفرق. ((رواه أبو داود والترمذي)).",
    "english": "Qailah bint Makhramah (May Allah be pleased with her) reported: I saw the Prophet (صلى الله عليه وسلم) seated with his arms enfolding his legs; and when I saw him in such a state of humble guise I trembled with fear due to the awe (he showed in that posture). [Abu Dawud and At-Tirmidhi] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 823 In-book reference : Book 4, Hadith 11",
    "grade": "",
    "arabic": "وعن الشريد بن سويد رضى الله عنه قال: مر بي رسول الله صلى الله عليه وسلم وأنا جالس هكذا، وقد وضعت يدي اليسرى خلف ظهري، واتكأت على إلية يدي فقال: \"أتقعد قعدة المغضوب عليهم؟!\" ((رواه أبو داود بإسناد صحيح)).",
    "english": "Ash-Sharid bin Suwaid (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) passed by me when I was sitting with my left hand behind my back and leaning on my palm. On seeing me in this posture he said, \"Do you sit like those upon whom the Wrath of Allah has descended?\" [Abu Dawud] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 824 In-book reference : Book 4, Hadith 12",
    "grade": "",
    "arabic": "عن ابن عمر رضى الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"لا يقمن أحدكم من مجلسه ثم يجلس فيه، ولكن توسعوا وتفسحوا\" وكان ابن عمر إذا قام له رجل من مجلسه لم يجلس فيه. ((متفق عليه)).",
    "english": "Ibn 'Umar (May Allah be pleased with them) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"Do not ask someone to give up his seat in order to take it, but make accommodation wide and sit at ease.\" It was Ibn 'Umar's habit that if a person left his seat for him, he would not take it. [Al-Bukhari and Muslim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 825 In-book reference : Book 4, Hadith 13",
    "grade": "",
    "arabic": "وعن أبى هريرة رضى الله عنه أن رسول الله صلى الله عليه وسلم قال: \"إذا قام أحدكم من مجلس، ثم رجع إليه، فهو أحق به\" . ((رواه مسلم)).",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"If someone leaves his seat (for one reason or another) and returns to it, he is better entitled to it.\" [Muslim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 826 In-book reference : Book 4, Hadith 14",
    "grade": "",
    "arabic": "وعن جابر بن سمرة رضى الله عنهما قال: كنا إذا أتينا النبي صلى الله عليه وسلم جلس أحدنا حيث ينتهي. ((رواه أبو داود والترمذي، وقال: \"حديث حسن\" )).",
    "english": "Jabir bin Samurah (May Allah be pleased with them) reported: Whenever we came to the gathering of the Prophet, we would sit down at the end (of the assembly). [Abu Dawud and At-Tirmidhi] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 827 In-book reference : Book 4, Hadith 15",
    "grade": "",
    "arabic": "وعن أبى عبد الله سلمان الفارسي رضى الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لا يغتسل رجل يوم الجمعة، ويتطهر ما استطاع من طهر، ويدهن من دهنه، أو يمس من طيب بيته، ثم يخرج فلا يفرق بين اثنين، ثم يصلى ما كتب له، ثم ينصت إذا تكلم الإمام، إلا غفر له ما بينه وبين الجمعة الأخرى\" ((رواه البخاري)).",
    "english": "Salman Al-Farisi (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"If a man takes a bath on Friday, purifies himself thoroughly, uses oil and perfume which is available in the house, sets forth for the mosque, does not (forcibly) sit between two persons, offers the prayer that is prescribed for him and listens to the Imam silently, his sins between this Friday and the previous Friday will be forgiven.\" [Al- Bukhari] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 828 In-book reference : Book 4, Hadith 16",
    "grade": "",
    "arabic": "وعن عمرو بن شعيب عن أبيه عن جده رضى الله عنه أن رسول الله صلى الله عليه وسلم قال: \"لا يحل لرجل أن يفرق بين اثنين إلا بإذنهما\" رواه أبو داود والترمذي وقال \"حديث حسن\". وفى رواية لأبى داود: \"لا يجلس بين رجلين إلا بإذنهما\".",
    "english": "'Amr bin Shu'aib on the authority of his father and grandfather reported: Messenger of Allah (صلى الله عليه وسلم) said, \"It is not permissible for a man to separate between two [people] without their permission.\" [Abu Dawud and At-Tirmidhi] . And in a version narrated by Abu Dawud \"He should not sit between two men without their permission.\""
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 829 In-book reference : Book 4, Hadith 17",
    "grade": "",
    "arabic": "وعن حذيفة بن اليمان رضى الله عنه أن رسول الله صلى الله عليه وسلم لعن من جلس وسط الحلقة. رواه أبو داود بإسناد صحيح. وروى الترمذى عن أبى مجلز: أن رجلا قعد وسط الحلقة، فقال حذيفة: ملعون على لسان محمد صلى الله عليه وسلم -من جلس وسط الحلقة. قال الترمذى: \"حديث حسن صحيح\" .",
    "english": "Hudhaifah bin Al-Yaman (May Allah be pleased with him) reported: The Messenger of Allah curses the one who sits in the middle of people's circle. [Abu Dawud] . A man sat in the middle of a circle so Hudhaifah (May Allah be pleased with him) said: Cursed upon the tongue of Muhammad (صلى الله عليه وسلم) or [he said] Allah has cursed upon the tongue of Muhammad (صلى الله عليه وسلم) he who sits in the middle of the circle [of a gathering]. [At-Tirmidhi] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 830 In-book reference : Book 4, Hadith 18",
    "grade": "",
    "arabic": "وعن أبى سعيد الخدرى رضى الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"خير المجالس أوسعها\" . ((رواه أبو داود بإسناد صحيح على شرط البخاري.))",
    "english": "Abu Sa'id Al-Khudri (May Allah be pleased with him) reported: I heard Messenger of Allah (صلى الله عليه وسلم) saying \"The best assemblies are those in which people make room for one another.\" [Abu Dawud] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 831 In-book reference : Book 4, Hadith 19",
    "grade": "",
    "arabic": "وعن أبى هريرة رضى الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من جلس في مجلس، فكثر فيه لغطه فقال قبل أن يقوم من مجلسه ذلك: سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك وأتوب إليك، إلا غفر له ما كان في مجلسه ذلك\" ((رَوَاهُ التِّرمِذِيُّ وَقَالَ حَدِيثٌ حَسَنٌ صحيح)).",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"Whoever sits in a gathering and indulges in useless talk and before getting up supplicates: 'Subhanaka Allahumma wa bihamdika, ash-hadu an la ilaha illa Anta, astaghfiruka wa atubu ilaika (O Allah, You are free from every imperfection; praise be to You. I testify that there is no true god except You; I ask Your Pardon and turn to You in repentance),' he will be forgiven for (the sins he may have intentionally or unintentionally committed) in that assembly.\" [At-Tirmidhi] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 832 In-book reference : Book 4, Hadith 20",
    "grade": "",
    "arabic": "وعن أبى برزة رضى الله عنه قال: كان رسول الله صلى الله عليه وسلم يقول بآخرة إذا أراد أن يقوم من المجلس: \"سبحانك الله وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك وأتوب إليك\" فقال رجل: يا رسول الله، إنك لتقول قولاً ما كنت تقوله فيما مضى؟ قال: \"ذلك كفارة لما يكون في المجلس. ((رواه أبو داود)).((ورواه الحاكم أبو عبيد الله في المستدرك من رواية عائشة رضى الله عنها وقال: صحيح بإسناد))",
    "english": "Abu Barzah (May Allah be pleased with him) reported: Towards the end of his life, Messenger of Allah (صلى الله عليه وسلم) would supplicate before leaving an assembly thus: \"Subhanaka Allahumma wa bihamdika, ash-hadu an la ilaha illa Anta, astaghfiruka wa atubu ilaika (O Allah, You are free from every imperfection; all praise is for You. I testify that there is no true god except You, I ask Your forgiveness and turn to You in repentance).'' A man once said to him: \"O Messenger of Allah! You have spoken such words as you have never uttered before.'' He said, \"It is an expiation of that which goes on in the assembly.'' [Abu Dawud and Al-Hakim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 833 In-book reference : Book 4, Hadith 21",
    "grade": "",
    "arabic": "وعن ابن عمر رَضِيَ اللَّهُ عَنهُ قال: قلما كان رَسُول اللَّهِ صلى الله عليه وسلم يقوم من مجلس حتى يدعو بهؤلاء الدعوات: \"اللهم اقسم لنا من خشيتك ما تحول به بيننا وبين معاصيك، ومن طاعتك ما تبلغنا به جنتك، ومن اليقين ما تهون به علينا مصائب الدنيا، اللهم متعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا، واجعله الوارث منا، واجعل ثأرنا على من ظلمنا، وانصرنا على من عادانا، ولا تجعل مصيبتنا في ديننا، ولا تجعل الدنيا أكبر همنا، ولا مبلغ علمنا، ولا تسلط علينا من لا يرحمنا\" ((رَوَاهُ التِّرمِذِيُّ وَقَالَ حَدِيثٌ حَسَنٌ)).",
    "english": "Ibn 'Umar (May Allah be pleased with them) reported: Messenger of Allah (صلى الله عليه وسلم) seldom left a gathering without supplicating in these terms: \"Allahumma-qsim lana min khashyatika ma tahulu bihi bainana wa baina ma'sika, wa min ta'atika ma tuballighuna bihi jannataka, wa minal-yaqini ma tuhawwinu 'alaina masa-'ibad-dunya. Allahumma matti'na biasma'ina, wa absarina, wa quwwatina ma ahyaitana, waj'alhul-waritha minna, waj'al tharana 'ala man zalamana, wansurna 'ala man 'adana, wa la taj'al musibatana fi dinina, wa la taj'alid-dunya akbara hammina, wa la mablagha 'ilmina, wa la tusallit 'alaina man-la yarhamuna, (O Allah, apportion to us such fear as should serve as a barrier between us and acts of disobedience; and such obedience as will take us to Your Jannah; and such as will make easy for us to bear in the calamities of this world. O Allah! let us enjoy our hearing, our sight and our power as long as You keep us alive and make our heirs from our own offspring, and make our revenge restricted to those who oppress us, and support us against those who are hostile to us let no misfortune afflict our Deen; let not worldly affairs be our principal concern, or the ultimate limit of our knowledge, and let not those rule over us who do not show mercy to us).\" [At- Tirmidhi] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 834 In-book reference : Book 4, Hadith 22",
    "grade": "",
    "arabic": "وعن أبي هريرة رَضِيَ اللَّهُ عَنهُ قال، قال رَسُول اللَّهِ صلى الله عليه وسلم: \"ما من قوم يقومون من مجلس ولا يذكرون اللَّه تعالى فيه إلا قاموا عن مثل جيفة حمار وكان لهم حسرة\" ((رَوَاهُ أبُو دَاوُدَ بإسناد صحيح)).",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"Those people who leave a gathering in which they have not remembered Allah, will conclude it as if it has foul odour similar to that of a rotten carcass of a donkey. And it will be a cause of grief to them.\" [Abu Dawud] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 835 In-book reference : Book 4, Hadith 23",
    "grade": "",
    "arabic": "وعنه عن النبي صلى الله عليه وسلم قال: \"ما جلس قوم مجلساً لم يذكروا الله تعالى فيه، ولم يصلوا على نبيهم فيه، إلا كان عليهم ترة؛ فإن شاء عذبهم، وإن شاء غفر لهم\" ((رَوَاهُ التِّرمِذِيُّ وَقَالَ: \"حَدِيثٌ حَسَنٌ\")).",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: The Prophet (صلى الله عليه وسلم) said, \"Whenever a group of people sit in a gathering in which they do not remember Allah the Exalted, nor supplicate to elevate the rank of their Prophet, such a gathering will be a cause of grief to them. If Allah wills, He will punish them, and if He wills He will forgive them.\" [At-Tirmidhi] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 836 In-book reference : Book 4, Hadith 24",
    "grade": "",
    "arabic": "وعنه عن رسول الله صلى الله عليه وسلم قال: \"من قعد مقعداً لم يذكر الله تعالى فيه كانت عليه من الله ترة، ومن اضطجع مضجعاً لم يذكر الله فيه كانت عليه من الله ترة\" ((رَوَاهُ أبُو دَاوُدَ)). وقد سبق قريباً، وشرحنا \"الترة\" فيه.",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"If anyone sits in a gathering where he does not remember Allah, he will bring grief upon himself (on the Day of Resurrection), and he who lies down in a place where he does not remember Allah, will bring grief upon himself (on the Day of Resurrection).\" [Abu Dawud] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 837 In-book reference : Book 4, Hadith 25",
    "grade": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"All that is left from Prophethood is the glad tidings.\" He was asked what the glad tidings were, and he said, \"The good dream.\" [Al-Bukhari] . وعن أبى هريرة رضى الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"لم يبق من النبوة إلا المبشرات\" قالوا: وما المبشرات؟ قال: \"الرؤيا الصالحة\" (( رَوَاهُ البُخَارِيُّ)).",
    "arabic": "وعن أبى هريرة رضى الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"لم يبق من النبوة إلا المبشرات\" قالوا: وما المبشرات؟ قال: \"الرؤيا الصالحة\" (( رَوَاهُ البُخَارِيُّ)).",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"All that is left from Prophethood is the glad tidings.\" He was asked what the glad tidings were, and he said, \"The good dream.\" [Al-Bukhari] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 838 In-book reference : Book 4, Hadith 26",
    "grade": "",
    "arabic": "وعنه أن النبي صلى الله عليه وسلم قال: \"إذا اقترب الزمان لم تكد رؤيا المؤمن تكذب، ورؤيا المؤمن جزء من ستة وأربعين جزءاً من النبوة\" ((مُتَّفَقٌ عَلَيهِ)). وفى رواية: \"أصدقكم رؤيا أصدقكم حديثاً\".",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: The Prophet (صلى الله عليه وسلم) said, \"When the time draws near (i.e., near the end of the world), the dream of a believer can hardly be false; and the dream of a believer represents one part from forty-six parts of Prophethood.\" [Al-Bukhari and Muslim] . One narration says: Messenger of Allah (صلى الله عليه وسلم) said, \"The most truthful of you in their speech are those who see the truest visions.\""
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 839 In-book reference : Book 4, Hadith 27",
    "grade": "",
    "arabic": "وعنه قال: قال رسول الله صلى الله عليه وسلم: \"من رآني في المنام فسيراني في اليقظة -أو كأنما رآني في اليقظة- لا يتمثل الشيطان بي\" ((مُتَّفَقٌ عَلَيهِ)).",
    "english": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"He who sees me in his dream will see me in his wakefulness (or he (صلى الله عليه وسلم) may have said it is as though he has seen me in a state of wakefulness), for Satan does not appear in my form.\" [Al-Bukhari and Muslim ] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 840 In-book reference : Book 4, Hadith 28",
    "grade": "",
    "arabic": "وعن أبى سعيد الخدرى رضى الله عنه انه سمع النبي صلى الله عليه وسلم، يقول: \"إذا رأى أحدكم رؤيا يحبها، فإنما هي من الله تعالى، فليحمد الله عليها، وليحدث بها -وفى رواية، فلا يحدث بها إلا من يحب- وإذا رأى غير ذلك مما يكره، فإنما هي من الشيطان، فليستعذ من شرها، ولا يذكرها لأحد، فإنها لا تضره\" (( مُتَّفَقٌ عَلَيهِ)).",
    "english": "Abu Sa'id Al-Khudri (May Allah be pleased with him) reported: I heard the Prophet (صلى الله عليه وسلم) saying, \"When one of you sees a dream that he likes, then it is from Allah. He should praise Allah for it and relate it to (others).\" Another narration adds: Messenger of Allah(صلى الله عليه وسلم) said, \"He should not report it except to those whom he loves. And if he sees one which he dislikes, then it is from the Satan. He should seek refuge in Allah against its evil and should not mention it to anyone. Then it will not harm him.\" [Al- Bukhari and Muslim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 841 In-book reference : Book 4, Hadith 29",
    "grade": "Abu Qatadah (May Allah be pleased with him) reported: The Prophet (صلى الله عليه وسلم) said, \"A good vision (dream) is from Allah and a bad dream is from the Satan. He who sees something in a dream that he dislikes, should blow thrice on his left, must seek Allah's Refuge from the evil of the Satan (i.e., by saying: A'udhu billahi minash-Shaitanir-Rajim). Then it will not harm him.\" [Al-Bukhari and Muslim] . وعن أبى قتادة رضى الله عنه قال: قال النبي صلى الله عليه وسلم: \"الرؤيا الصالحة -وفى رواية: الرؤيا الحسنة- من الله، والحلم من الشيطان، فمن رأى شيئاً يكره فلينفث عن شماله ثلاثاً، وليتعوذ من الشيطان فإنها لا تضره\" (( مُتَّفَقٌ عَلَيهِ)). النفث نفخ لطيف لا ريق معه.",
    "arabic": "وعن أبى قتادة رضى الله عنه قال: قال النبي صلى الله عليه وسلم: \"الرؤيا الصالحة -وفى رواية: الرؤيا الحسنة- من الله، والحلم من الشيطان، فمن رأى شيئاً يكره فلينفث عن شماله ثلاثاً، وليتعوذ من الشيطان فإنها لا تضره\" (( مُتَّفَقٌ عَلَيهِ)). النفث نفخ لطيف لا ريق معه.",
    "english": "Abu Qatadah (May Allah be pleased with him) reported: The Prophet (صلى الله عليه وسلم) said, \"A good vision (dream) is from Allah and a bad dream is from the Satan. He who sees something in a dream that he dislikes, should blow thrice on his left, must seek Allah's Refuge from the evil of the Satan (i.e., by saying: A'udhu billahi minash-Shaitanir-Rajim). Then it will not harm him.\" [Al-Bukhari and Muslim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 842 In-book reference : Book 4, Hadith 30",
    "grade": "",
    "arabic": "وعن جابر رضى الله عنه عن رسول الله صلى الله عليه وسلم قال: \"إذا رأى أحدكم الرؤيا يكرهها، فليبصق عن يساره ثلاثاً، وليستعذ بالله من الشيطان ثلاثاً، وليتحول عن جنبه الذي كان عليه\" ((رَوَاهُ مُسلِمٌ)).",
    "english": "Jabir (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"When one of you sees a bad dream let him blow three times on his left, seek refuge in Allah from the Satan three times (i.e., by saying: A'udhu billahi minash-Shaitanir-Rajim) and change the side on which he was lying.\" [Muslim] ."
  },
  {
    "collection": "riyadussalihin",
    "book": "4 The Book of the Etiquette of Sleeping, Lying and Sitting etc كتاب آداب النوم",
    "reference": "Reference : Riyad as-Salihin 843 In-book reference : Book 4, Hadith 31",
    "grade": "",
    "arabic": "وعن أبى الأسقع واثلة بن الأسقع رضى الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن من أعظم الفرى أن يدعى الرجل إلى غير أبيه، أو يرى عينيه ما لم تر، أو يقول على رسول الله صلى الله عليه وسلم ما لم يقل\" ((رَوَاهُ البُخَارِيُّ)).",
    "english": "Wathilah bin Al-Asqa' (May Allah be pleased with him) reported: Messenger of Allah (صلى الله عليه وسلم) said, \"Of the worst lies are: to claim a false father, or to pretend to have seen what one has not seen (tell a false dream), or to attribute to the Messenger of Allah (صلى الله عليه وسلم) what he has not said.\" [Al-Bukhari] ."
  }
]